In [1]:
import pymysql

conn = pymysql.connect( #pymysql 라이브러리 사용 DB연결
    host='127.0.0.1', 
    user='webuser2', 
    password='webuser2',
    db='pydb', 
    charset='utf8')
cur = conn.cursor()

In [2]:
#select 예제
conn = pymysql.connect( #pymysql 라이브러리 사용 DB연결
    host='127.0.0.1', 
    user='webuser2', 
    password='webuser2',
    db='pydb', 
    charset='utf8')
cur = conn.cursor()
cur.execute("SELECT * FROM book")

print("ID    title    writer         ")
print("--------------------------------------------------------")

while (True):
    row = cur.fetchone()
    if row == None:
        break
    data1 = row[0]
    data2 = row[1]
    data3 = row[2]
    
    print("%5s   %15s   %15s \n" % (data1, data2, data3))
    # print(f" ID: {data1}, title: {data2}, writer: {data3}")

conn.close()

ID    title    writer
--------------------------------------------------------
    1             안드로이드                한빛

    2             안드로이드                한빛

    3             안드로이드                한빛

    4         Oracle DB                한빛

    5            Spring                영딘

    6             안드로이드                한빛

    7             안드로이드                한빛

    8         Oracle DB                한빛

    9            Spring                영딘

In [14]:
#insert 예제
def insert_book(data):
    conn=pymysql.connect(host='localhost',user='webuser2',password='webuser2', db='pydb', charset='utf8')
    cursor=conn.cursor()
    sql="insert into book(title,pub,pages,author) values(%s,%s,%s,%s)"
    cursor.execute(sql,data)
    conn.commit()
    conn.close()
    
data=('안드로이드','한빛',650,'홍길동')
insert_book(data)

def insert_book_list(datas):
    conn=pymysql.connect(host='localhost',user='webuser2',password='webuser2',db='pydb',charset='utf8')
    cursor=conn.cursor()
    sql="insert into book(title,pub,pages,author) values(%s,%s,%s,%s)"
    cursor.executemany(sql,datas)
    conn.commit()
    conn.close()
datas=[('안드로이드','한빛',650,'홍길동'),
 ('Oracle DB','한빛',650,'홍길동'),
 ('Spring','영딘',650,'홍길동')]
insert_book_list(datas)

In [15]:
def select_all():
    conn=pymysql.connect(host='localhost',
                         user='webuser2',password='webuser2', db='pydb',charset='utf8')
    cursor=conn.cursor()
    sql="select * from book"
    cursor.execute(sql)
    for book in cursor:
        print(book)
    conn.close()
        
select_all()

(6, '안드로이드', '한빛', 650, '홍길동')
(7, '안드로이드', '한빛', 650, '홍길동')
(8, 'Oracle DB', '한빛', 650, '홍길동')
(9, 'Spring', '영딘', 650, '홍길동')
(10, '안드로이드', '한빛', 650, '홍길동')
(11, '안드로이드', '한빛', 650, '홍길동')
(12, 'Oracle DB', '한빛', 650, '홍길동')
(13, 'Spring', '영딘', 650, '홍길동')
(14, '안드로이드', '한빛', 650, '홍길동')
(15, '안드로이드', '한빛', 650, '홍길동')
(16, 'Oracle DB', '한빛', 650, '홍길동')
(17, 'Spring', '영딘', 650, '홍길동')

In [16]:
def update_book(data):
    conn=pymysql.connect(host='localhost'
                         ,user='webuser2',password='webuser2',db='pydb',charset='utf8')
    cursor=conn.cursor()
    sql="update book set title=%s, pub=%s, pages=%s, author=%s where id=%s"
    cursor.execute(sql,data)
    conn.commit()
    conn.close()
data=('Java', '생능','700','홍길동',15)
update_book(data)
select_all()

(6, '안드로이드', '한빛', 650, '홍길동')
(7, '안드로이드', '한빛', 650, '홍길동')
(8, 'Oracle DB', '한빛', 650, '홍길동')
(9, 'Spring', '영딘', 650, '홍길동')
(10, '안드로이드', '한빛', 650, '홍길동')
(11, '안드로이드', '한빛', 650, '홍길동')
(12, 'Oracle DB', '한빛', 650, '홍길동')
(13, 'Spring', '영딘', 650, '홍길동')
(14, '안드로이드', '한빛', 650, '홍길동')
(15, 'Java', '생능', 700, '홍길동')
(16, 'Oracle DB', '한빛', 650, '홍길동')
(17, 'Spring', '영딘', 650, '홍길동')

In [17]:
def delete_book(data):
    conn=pymysql.connect(host='localhost'
                         ,user='webuser2',password='webuser2',db='pydb',charset='utf8')
    cursor=conn.cursor()
    sql="delete from book where id=%s"
    #cursor.execute(sql,data)
    cursor.executemany(sql,data)
    conn.commit()
    conn.close()
    
#delete_book(4)
delete_book([6,7,8,9,10])
select_all()

(11, '안드로이드', '한빛', 650, '홍길동')
(12, 'Oracle DB', '한빛', 650, '홍길동')
(13, 'Spring', '영딘', 650, '홍길동')
(14, '안드로이드', '한빛', 650, '홍길동')
(15, 'Java', '생능', 700, '홍길동')
(16, 'Oracle DB', '한빛', 650, '홍길동')
(17, 'Spring', '영딘', 650, '홍길동')